src/modules/webhooks/__recordings__/TransactionRefundRequestedWebhookHandler_2252282828/American-Express-pm_card_amex_1702901941/should-request-a-partial-refund-in-Stripe-after-a-charge_1798832548/recording.har

{
  "log": {
    "_recordingName": "TransactionRefundRequestedWebhookHandler/'American Express' 'pm_card_amex'/should request a partial refund in Stripe after a charge",
    "creator": {
      "comment": "persister:fs",
      "name": "Polly.JS",
      "version": "6.0.5"
    },
    "entries": [
      {
        "_id": "1ea5180fb4c4f3d2b0c8a2d5b8aa3b8c",
        "_order": 0,
        "cache": {},
        "request": {
          "bodySize": 153,
          "cookies": [],
          "headers": [
            {
              "name": "accept",
              "value": "application/json"
            },
            {
              "name": "content-length",
              "value": "153"
            },
            {
              "name": "content-type",
              "value": "application/x-www-form-urlencoded"
            },
            {
              "name": "stripe-version",
              "value": "2022-11-15"
            },
            {
              "name": "user-agent",
              "value": "Stripe/v1 NodeBindings/12.10.0"
            }
          ],
          "headersSize": 741,
          "httpVersion": "HTTP/1.1",
          "method": "POST",
          "postData": {
            "mimeType": "application/x-www-form-urlencoded",
            "params": [],
            "text": "amount=22299&currency=PLN&capture_method=automatic&metadata[transactionId]=555555&metadata[channelId]=1&metadata[checkoutId]=c29tZS1jaGVja291dC1pZA%3D%3D"
          },
          "queryString": [],
          "url": "https://api.stripe.com/v1/payment_intents"
        },
        "response": {
          "bodySize": 1378,
          "content": {
            "mimeType": "application/json",
            "size": 1378,
            "text": {
              "amount": 22299,
              "amount_capturable": 0,
              "amount_details": {
                "tip": {}
              },
              "amount_received": 0,
              "application": null,
              "application_fee_amount": null,
              "automatic_payment_methods": null,
              "canceled_at": null,
              "cancellation_reason": null,
              "capture_method": "automatic",
              "client_secret": "pi_3NRCXvEosEcNBN5m0fnw4XJn_secret_oEefrAANMLxRRXOMiCLXTSHwV",
              "confirmation_method": "automatic",
              "created": 1688728195,
              "currency": "pln",
              "customer": null,
              "description": null,
              "id": "pi_3NRCXvEosEcNBN5m0fnw4XJn",
              "invoice": null,
              "last_payment_error": null,
              "latest_charge": null,
              "livemode": false,
              "metadata": {
                "channelId": "1",
                "checkoutId": "c29tZS1jaGVja291dC1pZA==",
                "transactionId": "555555"
              },
              "next_action": null,
              "object": "payment_intent",
              "on_behalf_of": null,
              "payment_method": null,
              "payment_method_options": {
                "card": {
                  "installments": null,
                  "mandate_options": null,
                  "network": null,
                  "request_three_d_secure": "automatic"
                }
              },
              "payment_method_types": [
                "card"
              ],
              "processing": null,
              "receipt_email": null,
              "review": null,
              "setup_future_usage": null,
              "shipping": null,
              "source": null,
              "statement_descriptor": null,
              "statement_descriptor_suffix": null,
              "status": "requires_payment_method",
              "transfer_data": null,
              "transfer_group": null
            }
          },
          "cookies": [],
          "headers": [
            {
              "name": "access-control-allow-credentials",
              "value": "true"
            },
            {
              "name": "access-control-allow-methods",
              "value": "GET, POST, HEAD, OPTIONS, DELETE"
            },
            {
              "name": "access-control-allow-origin",
              "value": "*"
            },
            {
              "name": "access-control-expose-headers",
              "value": "Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required"
            },
            {
              "name": "access-control-max-age",
              "value": "300"
            },
            {
              "name": "cache-control",
              "value": "no-cache, no-store"
            },
            {
              "name": "connection",
              "value": "keep-alive"
            },
            {
              "name": "content-length",
              "value": "1378"
            },
            {
              "name": "content-type",
              "value": "application/json"
            },
            {
              "name": "date",
              "value": "Fri, 07 Jul 2023 11:09:55 GMT"
            },
            {
              "name": "idempotency-key",
              "value": "6cd590a9-7bca-4a4d-87c6-4038c17e4b7e"
            },
            {
              "name": "original-request",
              "value": "req_1a0s2ua0tavtAh"
            },
            {
              "name": "request-id",
              "value": "req_1a0s2ua0tavtAh"
            },
            {
              "name": "server",
              "value": "nginx"
            },
            {
              "name": "strict-transport-security",
              "value": "max-age=63072000; includeSubDomains; preload"
            },
            {
              "name": "stripe-should-retry",
              "value": "false"
            },
            {
              "name": "stripe-version",
              "value": "2022-11-15"
            },
            {
              "name": "x-stripe-routing-context-priority-tier",
              "value": "api-testmode"
            }
          ],
          "headersSize": 777,
          "httpVersion": "HTTP/1.1",
          "redirectURL": "",
          "status": 200,
          "statusText": "OK"
        },
        "startedDateTime": "2023-07-07T11:09:55.526Z",
        "time": 303,
        "timings": {
          "blocked": -1,
          "connect": -1,
          "dns": -1,
          "receive": 0,
          "send": 0,
          "ssl": -1,
          "wait": 303
        }
      },
      {
        "_id": "6af93f2043e7807702b31fe3a471770c",
        "_order": 0,
        "cache": {},
        "request": {
          "bodySize": 27,
          "cookies": [],
          "headers": [
            {
              "name": "accept",
              "value": "application/json"
            },
            {
              "name": "content-length",
              "value": "27"
            },
            {
              "name": "content-type",
              "value": "application/x-www-form-urlencoded"
            },
            {
              "name": "stripe-version",
              "value": "2022-11-15"
            },
            {
              "name": "user-agent",
              "value": "Stripe/v1 NodeBindings/12.10.0"
            }
          ],
          "headersSize": 776,
          "httpVersion": "HTTP/1.1",
          "method": "POST",
          "postData": {
            "mimeType": "application/x-www-form-urlencoded",
            "params": [],
            "text": "payment_method=pm_card_amex"
          },
          "queryString": [],
          "url": "https://api.stripe.com/v1/payment_intents/pi_3NRCXvEosEcNBN5m0fnw4XJn/confirm"
        },
        "response": {
          "bodySize": 1418,
          "content": {
            "mimeType": "application/json",
            "size": 1418,
            "text": {
              "amount": 22299,
              "amount_capturable": 0,
              "amount_details": {
                "tip": {}
              },
              "amount_received": 22299,
              "application": null,
              "application_fee_amount": null,
              "automatic_payment_methods": null,
              "canceled_at": null,
              "cancellation_reason": null,
              "capture_method": "automatic",
              "client_secret": "pi_3NRCXvEosEcNBN5m0fnw4XJn_secret_oEefrAANMLxRRXOMiCLXTSHwV",
              "confirmation_method": "automatic",
              "created": 1688728195,
              "currency": "pln",
              "customer": null,
              "description": null,
              "id": "pi_3NRCXvEosEcNBN5m0fnw4XJn",
              "invoice": null,
              "last_payment_error": null,
              "latest_charge": "ch_3NRCXvEosEcNBN5m05A703p6",
              "livemode": false,
              "metadata": {
                "channelId": "1",
                "checkoutId": "c29tZS1jaGVja291dC1pZA==",
                "transactionId": "555555"
              },
              "next_action": null,
              "object": "payment_intent",
              "on_behalf_of": null,
              "payment_method": "pm_1NRCXwEosEcNBN5moSyFdFzz",
              "payment_method_options": {
                "card": {
                  "installments": null,
                  "mandate_options": null,
                  "network": null,
                  "request_three_d_secure": "automatic"
                }
              },
              "payment_method_types": [
                "card"
              ],
              "processing": null,
              "receipt_email": null,
              "review": null,
              "setup_future_usage": null,
              "shipping": null,
              "source": null,
              "statement_descriptor": null,
              "statement_descriptor_suffix": null,
              "status": "succeeded",
              "transfer_data": null,
              "transfer_group": null
            }
          },
          "cookies": [],
          "headers": [
            {
              "name": "access-control-allow-credentials",
              "value": "true"
            },
            {
              "name": "access-control-allow-methods",
              "value": "GET, POST, HEAD, OPTIONS, DELETE"
            },
            {
              "name": "access-control-allow-origin",
              "value": "*"
            },
            {
              "name": "access-control-expose-headers",
              "value": "Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required"
            },
            {
              "name": "access-control-max-age",
              "value": "300"
            },
            {
              "name": "cache-control",
              "value": "no-cache, no-store"
            },
            {
              "name": "connection",
              "value": "keep-alive"
            },
            {
              "name": "content-length",
              "value": "1418"
            },
            {
              "name": "content-type",
              "value": "application/json"
            },
            {
              "name": "date",
              "value": "Fri, 07 Jul 2023 11:09:57 GMT"
            },
            {
              "name": "idempotency-key",
              "value": "122981a9-0d1f-465d-a291-a24fda2f22e8"
            },
            {
              "name": "original-request",
              "value": "req_vCKHRMDMtdbX2P"
            },
            {
              "name": "request-id",
              "value": "req_vCKHRMDMtdbX2P"
            },
            {
              "name": "server",
              "value": "nginx"
            },
            {
              "name": "strict-transport-security",
              "value": "max-age=63072000; includeSubDomains; preload"
            },
            {
              "name": "stripe-should-retry",
              "value": "false"
            },
            {
              "name": "stripe-version",
              "value": "2022-11-15"
            },
            {
              "name": "x-stripe-routing-context-priority-tier",
              "value": "api-testmode"
            }
          ],
          "headersSize": 777,
          "httpVersion": "HTTP/1.1",
          "redirectURL": "",
          "status": 200,
          "statusText": "OK"
        },
        "startedDateTime": "2023-07-07T11:09:55.833Z",
        "time": 1380,
        "timings": {
          "blocked": -1,
          "connect": -1,
          "dns": -1,
          "receive": 0,
          "send": 0,
          "ssl": -1,
          "wait": 1380
        }
      },
      {
        "_id": "2259952935ac6487e906c3bba92ef54a",
        "_order": 0,
        "cache": {},
        "request": {
          "bodySize": 54,
          "cookies": [],
          "headers": [
            {
              "name": "accept",
              "value": "application/json"
            },
            {
              "name": "content-length",
              "value": "54"
            },
            {
              "name": "content-type",
              "value": "application/x-www-form-urlencoded"
            },
            {
              "name": "stripe-version",
              "value": "2022-11-15"
            },
            {
              "name": "user-agent",
              "value": "Stripe/v1 NodeBindings/12.10.0"
            }
          ],
          "headersSize": 732,
          "httpVersion": "HTTP/1.1",
          "method": "POST",
          "postData": {
            "mimeType": "application/x-www-form-urlencoded",
            "params": [],
            "text": "payment_intent=pi_3NRCXvEosEcNBN5m0fnw4XJn&amount=4999"
          },
          "queryString": [],
          "url": "https://api.stripe.com/v1/refunds"
        },
        "response": {
          "bodySize": 430,
          "content": {
            "mimeType": "application/json",
            "size": 430,
            "text": {
              "amount": 4999,
              "balance_transaction": "txn_3NRCXvEosEcNBN5m08gFWu8M",
              "charge": "ch_3NRCXvEosEcNBN5m05A703p6",
              "created": 1688728197,
              "currency": "pln",
              "id": "re_3NRCXvEosEcNBN5m0vuTYr3Y",
              "metadata": {},
              "object": "refund",
              "payment_intent": "pi_3NRCXvEosEcNBN5m0fnw4XJn",
              "reason": null,
              "receipt_number": null,
              "source_transfer_reversal": null,
              "status": "succeeded",
              "transfer_reversal": null
            }
          },
          "cookies": [],
          "headers": [
            {
              "name": "access-control-allow-credentials",
              "value": "true"
            },
            {
              "name": "access-control-allow-methods",
              "value": "GET, POST, HEAD, OPTIONS, DELETE"
            },
            {
              "name": "access-control-allow-origin",
              "value": "*"
            },
            {
              "name": "access-control-expose-headers",
              "value": "Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required"
            },
            {
              "name": "access-control-max-age",
              "value": "300"
            },
            {
              "name": "cache-control",
              "value": "no-cache, no-store"
            },
            {
              "name": "connection",
              "value": "keep-alive"
            },
            {
              "name": "content-length",
              "value": "430"
            },
            {
              "name": "content-type",
              "value": "application/json"
            },
            {
              "name": "date",
              "value": "Fri, 07 Jul 2023 11:09:58 GMT"
            },
            {
              "name": "idempotency-key",
              "value": "3180251e-d81b-45b2-b542-c13bc9458a81"
            },
            {
              "name": "original-request",
              "value": "req_tsdlZ8N4zuLs86"
            },
            {
              "name": "request-id",
              "value": "req_tsdlZ8N4zuLs86"
            },
            {
              "name": "server",
              "value": "nginx"
            },
            {
              "name": "strict-transport-security",
              "value": "max-age=63072000; includeSubDomains; preload"
            },
            {
              "name": "stripe-should-retry",
              "value": "false"
            },
            {
              "name": "stripe-version",
              "value": "2022-11-15"
            },
            {
              "name": "x-stripe-routing-context-priority-tier",
              "value": "api-testmode"
            }
          ],
          "headersSize": 776,
          "httpVersion": "HTTP/1.1",
          "redirectURL": "",
          "status": 200,
          "statusText": "OK"
        },
        "startedDateTime": "2023-07-07T11:09:57.218Z",
        "time": 955,
        "timings": {
          "blocked": -1,
          "connect": -1,
          "dns": -1,
          "receive": 0,
          "send": 0,
          "ssl": -1,
          "wait": 955
        }
      }
    ],
    "pages": [],
    "version": "1.2"
  }
}
