src/modules/webhooks/__recordings__/TransactionRefundRequestedWebhookHandler_2252282828/American-Express-pm_card_amex_1702901941/should-request-a-partial-refund-in-Stripe-after-authorize-and-charge_590324687/recording.har

{
  "log": {
    "_recordingName": "TransactionRefundRequestedWebhookHandler/'American Express' 'pm_card_amex'/should request a partial refund in Stripe after authorize and charge",
    "creator": {
      "comment": "persister:fs",
      "name": "Polly.JS",
      "version": "6.0.5"
    },
    "entries": [
      {
        "_id": "6f4d033948922aa393e870d1c92ad0e6",
        "_order": 0,
        "cache": {},
        "request": {
          "bodySize": 150,
          "cookies": [],
          "headers": [
            {
              "name": "accept",
              "value": "application/json"
            },
            {
              "name": "content-length",
              "value": "150"
            },
            {
              "name": "content-type",
              "value": "application/x-www-form-urlencoded"
            },
            {
              "name": "stripe-version",
              "value": "2022-11-15"
            },
            {
              "name": "user-agent",
              "value": "Stripe/v1 NodeBindings/12.12.0"
            }
          ],
          "headersSize": 741,
          "httpVersion": "HTTP/1.1",
          "method": "POST",
          "postData": {
            "mimeType": "application/x-www-form-urlencoded",
            "params": [],
            "text": "amount=22299&currency=PLN&capture_method=manual&metadata[transactionId]=555555&metadata[channelId]=1&metadata[checkoutId]=c29tZS1jaGVja291dC1pZA%3D%3D"
          },
          "queryString": [],
          "url": "https://api.stripe.com/v1/payment_intents"
        },
        "response": {
          "bodySize": 1375,
          "content": {
            "mimeType": "application/json",
            "size": 1375,
            "text": {
              "amount": 22299,
              "amount_capturable": 0,
              "amount_details": {
                "tip": {}
              },
              "amount_received": 0,
              "application": null,
              "application_fee_amount": null,
              "automatic_payment_methods": null,
              "canceled_at": null,
              "cancellation_reason": null,
              "capture_method": "manual",
              "client_secret": "pi_FAKE_CLIENT_SECRET",
              "confirmation_method": "automatic",
              "created": 1689065661,
              "currency": "pln",
              "customer": null,
              "description": null,
              "id": "pi_3NScKvEosEcNBN5m1jKLEqeL",
              "invoice": null,
              "last_payment_error": null,
              "latest_charge": null,
              "livemode": false,
              "metadata": {
                "channelId": "1",
                "checkoutId": "c29tZS1jaGVja291dC1pZA==",
                "transactionId": "555555"
              },
              "next_action": null,
              "object": "payment_intent",
              "on_behalf_of": null,
              "payment_method": null,
              "payment_method_options": {
                "card": {
                  "installments": null,
                  "mandate_options": null,
                  "network": null,
                  "request_three_d_secure": "automatic"
                }
              },
              "payment_method_types": [
                "card"
              ],
              "processing": null,
              "receipt_email": null,
              "review": null,
              "setup_future_usage": null,
              "shipping": null,
              "source": null,
              "statement_descriptor": null,
              "statement_descriptor_suffix": null,
              "status": "requires_payment_method",
              "transfer_data": null,
              "transfer_group": null
            }
          },
          "cookies": [],
          "headers": [
            {
              "name": "access-control-allow-credentials",
              "value": "true"
            },
            {
              "name": "access-control-allow-methods",
              "value": "GET, POST, HEAD, OPTIONS, DELETE"
            },
            {
              "name": "access-control-allow-origin",
              "value": "*"
            },
            {
              "name": "access-control-expose-headers",
              "value": "Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required"
            },
            {
              "name": "access-control-max-age",
              "value": "300"
            },
            {
              "name": "cache-control",
              "value": "no-cache, no-store"
            },
            {
              "name": "connection",
              "value": "keep-alive"
            },
            {
              "name": "content-length",
              "value": "1375"
            },
            {
              "name": "content-type",
              "value": "application/json"
            },
            {
              "name": "date",
              "value": "Tue, 11 Jul 2023 08:54:21 GMT"
            },
            {
              "name": "idempotency-key",
              "value": "ca25dec4-55cb-41af-a6a2-92124d02c028"
            },
            {
              "name": "original-request",
              "value": "req_IfNvrLa07ioGc4"
            },
            {
              "name": "request-id",
              "value": "req_IfNvrLa07ioGc4"
            },
            {
              "name": "server",
              "value": "nginx"
            },
            {
              "name": "strict-transport-security",
              "value": "max-age=63072000; includeSubDomains; preload"
            },
            {
              "name": "stripe-should-retry",
              "value": "false"
            },
            {
              "name": "stripe-version",
              "value": "2022-11-15"
            },
            {
              "name": "x-stripe-routing-context-priority-tier",
              "value": "api-testmode"
            }
          ],
          "headersSize": 777,
          "httpVersion": "HTTP/1.1",
          "redirectURL": "",
          "status": 200,
          "statusText": "OK"
        },
        "startedDateTime": "2023-07-11T08:54:21.258Z",
        "time": 305,
        "timings": {
          "blocked": -1,
          "connect": -1,
          "dns": -1,
          "receive": 0,
          "send": 0,
          "ssl": -1,
          "wait": 305
        }
      },
      {
        "_id": "f2e3339ae022b673b2efcd905c96c1a2",
        "_order": 0,
        "cache": {},
        "request": {
          "bodySize": 27,
          "cookies": [],
          "headers": [
            {
              "name": "accept",
              "value": "application/json"
            },
            {
              "name": "content-length",
              "value": "27"
            },
            {
              "name": "content-type",
              "value": "application/x-www-form-urlencoded"
            },
            {
              "name": "stripe-version",
              "value": "2022-11-15"
            },
            {
              "name": "user-agent",
              "value": "Stripe/v1 NodeBindings/12.12.0"
            }
          ],
          "headersSize": 776,
          "httpVersion": "HTTP/1.1",
          "method": "POST",
          "postData": {
            "mimeType": "application/x-www-form-urlencoded",
            "params": [],
            "text": "payment_method=pm_card_amex"
          },
          "queryString": [],
          "url": "https://api.stripe.com/v1/payment_intents/pi_3NScKvEosEcNBN5m1jKLEqeL/confirm"
        },
        "response": {
          "bodySize": 1422,
          "content": {
            "mimeType": "application/json",
            "size": 1422,
            "text": {
              "amount": 22299,
              "amount_capturable": 22299,
              "amount_details": {
                "tip": {}
              },
              "amount_received": 0,
              "application": null,
              "application_fee_amount": null,
              "automatic_payment_methods": null,
              "canceled_at": null,
              "cancellation_reason": null,
              "capture_method": "manual",
              "client_secret": "pi_FAKE_CLIENT_SECRET",
              "confirmation_method": "automatic",
              "created": 1689065661,
              "currency": "pln",
              "customer": null,
              "description": null,
              "id": "pi_3NScKvEosEcNBN5m1jKLEqeL",
              "invoice": null,
              "last_payment_error": null,
              "latest_charge": "ch_3NScKvEosEcNBN5m10Rm5zF9",
              "livemode": false,
              "metadata": {
                "channelId": "1",
                "checkoutId": "c29tZS1jaGVja291dC1pZA==",
                "transactionId": "555555"
              },
              "next_action": null,
              "object": "payment_intent",
              "on_behalf_of": null,
              "payment_method": "pm_1NScKvEosEcNBN5mvbBzIJsL",
              "payment_method_options": {
                "card": {
                  "installments": null,
                  "mandate_options": null,
                  "network": null,
                  "request_three_d_secure": "automatic"
                }
              },
              "payment_method_types": [
                "card"
              ],
              "processing": null,
              "receipt_email": null,
              "review": null,
              "setup_future_usage": null,
              "shipping": null,
              "source": null,
              "statement_descriptor": null,
              "statement_descriptor_suffix": null,
              "status": "requires_capture",
              "transfer_data": null,
              "transfer_group": null
            }
          },
          "cookies": [],
          "headers": [
            {
              "name": "access-control-allow-credentials",
              "value": "true"
            },
            {
              "name": "access-control-allow-methods",
              "value": "GET, POST, HEAD, OPTIONS, DELETE"
            },
            {
              "name": "access-control-allow-origin",
              "value": "*"
            },
            {
              "name": "access-control-expose-headers",
              "value": "Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required"
            },
            {
              "name": "access-control-max-age",
              "value": "300"
            },
            {
              "name": "cache-control",
              "value": "no-cache, no-store"
            },
            {
              "name": "connection",
              "value": "keep-alive"
            },
            {
              "name": "content-length",
              "value": "1422"
            },
            {
              "name": "content-type",
              "value": "application/json"
            },
            {
              "name": "date",
              "value": "Tue, 11 Jul 2023 08:54:22 GMT"
            },
            {
              "name": "idempotency-key",
              "value": "ccf49494-68ba-439b-a97a-229cece6c18f"
            },
            {
              "name": "original-request",
              "value": "req_KlWj4DjOCA6fKX"
            },
            {
              "name": "request-id",
              "value": "req_KlWj4DjOCA6fKX"
            },
            {
              "name": "server",
              "value": "nginx"
            },
            {
              "name": "strict-transport-security",
              "value": "max-age=63072000; includeSubDomains; preload"
            },
            {
              "name": "stripe-should-retry",
              "value": "false"
            },
            {
              "name": "stripe-version",
              "value": "2022-11-15"
            },
            {
              "name": "x-stripe-routing-context-priority-tier",
              "value": "api-testmode"
            }
          ],
          "headersSize": 777,
          "httpVersion": "HTTP/1.1",
          "redirectURL": "",
          "status": 200,
          "statusText": "OK"
        },
        "startedDateTime": "2023-07-11T08:54:21.566Z",
        "time": 1040,
        "timings": {
          "blocked": -1,
          "connect": -1,
          "dns": -1,
          "receive": 0,
          "send": 0,
          "ssl": -1,
          "wait": 1040
        }
      },
      {
        "_id": "70a8cfac3d3ae6edc80f9b4cef5a4390",
        "_order": 0,
        "cache": {},
        "request": {
          "bodySize": 23,
          "cookies": [],
          "headers": [
            {
              "name": "accept",
              "value": "application/json"
            },
            {
              "name": "content-length",
              "value": "23"
            },
            {
              "name": "content-type",
              "value": "application/x-www-form-urlencoded"
            },
            {
              "name": "stripe-version",
              "value": "2022-11-15"
            },
            {
              "name": "user-agent",
              "value": "Stripe/v1 NodeBindings/12.12.0"
            }
          ],
          "headersSize": 776,
          "httpVersion": "HTTP/1.1",
          "method": "POST",
          "postData": {
            "mimeType": "application/x-www-form-urlencoded",
            "params": [],
            "text": "amount_to_capture=22299"
          },
          "queryString": [],
          "url": "https://api.stripe.com/v1/payment_intents/pi_3NScKvEosEcNBN5m1jKLEqeL/capture"
        },
        "response": {
          "bodySize": 1415,
          "content": {
            "mimeType": "application/json",
            "size": 1415,
            "text": {
              "amount": 22299,
              "amount_capturable": 0,
              "amount_details": {
                "tip": {}
              },
              "amount_received": 22299,
              "application": null,
              "application_fee_amount": null,
              "automatic_payment_methods": null,
              "canceled_at": null,
              "cancellation_reason": null,
              "capture_method": "manual",
              "client_secret": "pi_FAKE_CLIENT_SECRET",
              "confirmation_method": "automatic",
              "created": 1689065661,
              "currency": "pln",
              "customer": null,
              "description": null,
              "id": "pi_3NScKvEosEcNBN5m1jKLEqeL",
              "invoice": null,
              "last_payment_error": null,
              "latest_charge": "ch_3NScKvEosEcNBN5m10Rm5zF9",
              "livemode": false,
              "metadata": {
                "channelId": "1",
                "checkoutId": "c29tZS1jaGVja291dC1pZA==",
                "transactionId": "555555"
              },
              "next_action": null,
              "object": "payment_intent",
              "on_behalf_of": null,
              "payment_method": "pm_1NScKvEosEcNBN5mvbBzIJsL",
              "payment_method_options": {
                "card": {
                  "installments": null,
                  "mandate_options": null,
                  "network": null,
                  "request_three_d_secure": "automatic"
                }
              },
              "payment_method_types": [
                "card"
              ],
              "processing": null,
              "receipt_email": null,
              "review": null,
              "setup_future_usage": null,
              "shipping": null,
              "source": null,
              "statement_descriptor": null,
              "statement_descriptor_suffix": null,
              "status": "succeeded",
              "transfer_data": null,
              "transfer_group": null
            }
          },
          "cookies": [],
          "headers": [
            {
              "name": "access-control-allow-credentials",
              "value": "true"
            },
            {
              "name": "access-control-allow-methods",
              "value": "GET, POST, HEAD, OPTIONS, DELETE"
            },
            {
              "name": "access-control-allow-origin",
              "value": "*"
            },
            {
              "name": "access-control-expose-headers",
              "value": "Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required"
            },
            {
              "name": "access-control-max-age",
              "value": "300"
            },
            {
              "name": "cache-control",
              "value": "no-cache, no-store"
            },
            {
              "name": "connection",
              "value": "keep-alive"
            },
            {
              "name": "content-length",
              "value": "1415"
            },
            {
              "name": "content-type",
              "value": "application/json"
            },
            {
              "name": "date",
              "value": "Tue, 11 Jul 2023 08:54:23 GMT"
            },
            {
              "name": "idempotency-key",
              "value": "5fa89709-881c-4f78-af03-c1e389ab1912"
            },
            {
              "name": "original-request",
              "value": "req_IhtSohsEAuTDkY"
            },
            {
              "name": "request-id",
              "value": "req_IhtSohsEAuTDkY"
            },
            {
              "name": "server",
              "value": "nginx"
            },
            {
              "name": "strict-transport-security",
              "value": "max-age=63072000; includeSubDomains; preload"
            },
            {
              "name": "stripe-should-retry",
              "value": "false"
            },
            {
              "name": "stripe-version",
              "value": "2022-11-15"
            },
            {
              "name": "x-stripe-routing-context-priority-tier",
              "value": "api-testmode"
            }
          ],
          "headersSize": 777,
          "httpVersion": "HTTP/1.1",
          "redirectURL": "",
          "status": 200,
          "statusText": "OK"
        },
        "startedDateTime": "2023-07-11T08:54:22.610Z",
        "time": 795,
        "timings": {
          "blocked": -1,
          "connect": -1,
          "dns": -1,
          "receive": 0,
          "send": 0,
          "ssl": -1,
          "wait": 795
        }
      },
      {
        "_id": "dc11e297b661a964b4409d977aa60751",
        "_order": 0,
        "cache": {},
        "request": {
          "bodySize": 54,
          "cookies": [],
          "headers": [
            {
              "name": "accept",
              "value": "application/json"
            },
            {
              "name": "content-length",
              "value": "54"
            },
            {
              "name": "content-type",
              "value": "application/x-www-form-urlencoded"
            },
            {
              "name": "stripe-version",
              "value": "2022-11-15"
            },
            {
              "name": "user-agent",
              "value": "Stripe/v1 NodeBindings/12.12.0"
            }
          ],
          "headersSize": 732,
          "httpVersion": "HTTP/1.1",
          "method": "POST",
          "postData": {
            "mimeType": "application/x-www-form-urlencoded",
            "params": [],
            "text": "payment_intent=pi_3NScKvEosEcNBN5m1jKLEqeL&amount=4999"
          },
          "queryString": [],
          "url": "https://api.stripe.com/v1/refunds"
        },
        "response": {
          "bodySize": 430,
          "content": {
            "mimeType": "application/json",
            "size": 430,
            "text": {
              "amount": 4999,
              "balance_transaction": "txn_3NScKvEosEcNBN5m1tUeTll5",
              "charge": "ch_3NScKvEosEcNBN5m10Rm5zF9",
              "created": 1689065663,
              "currency": "pln",
              "id": "re_3NScKvEosEcNBN5m1n7Ejq8g",
              "metadata": {},
              "object": "refund",
              "payment_intent": "pi_3NScKvEosEcNBN5m1jKLEqeL",
              "reason": null,
              "receipt_number": null,
              "source_transfer_reversal": null,
              "status": "succeeded",
              "transfer_reversal": null
            }
          },
          "cookies": [],
          "headers": [
            {
              "name": "access-control-allow-credentials",
              "value": "true"
            },
            {
              "name": "access-control-allow-methods",
              "value": "GET, POST, HEAD, OPTIONS, DELETE"
            },
            {
              "name": "access-control-allow-origin",
              "value": "*"
            },
            {
              "name": "access-control-expose-headers",
              "value": "Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required"
            },
            {
              "name": "access-control-max-age",
              "value": "300"
            },
            {
              "name": "cache-control",
              "value": "no-cache, no-store"
            },
            {
              "name": "connection",
              "value": "keep-alive"
            },
            {
              "name": "content-length",
              "value": "430"
            },
            {
              "name": "content-type",
              "value": "application/json"
            },
            {
              "name": "date",
              "value": "Tue, 11 Jul 2023 08:54:24 GMT"
            },
            {
              "name": "idempotency-key",
              "value": "f96ec51a-0dbe-4f65-a778-59cc1a88c28a"
            },
            {
              "name": "original-request",
              "value": "req_j4gFyDig6x3iZ3"
            },
            {
              "name": "request-id",
              "value": "req_j4gFyDig6x3iZ3"
            },
            {
              "name": "server",
              "value": "nginx"
            },
            {
              "name": "strict-transport-security",
              "value": "max-age=63072000; includeSubDomains; preload"
            },
            {
              "name": "stripe-should-retry",
              "value": "false"
            },
            {
              "name": "stripe-version",
              "value": "2022-11-15"
            },
            {
              "name": "x-stripe-routing-context-priority-tier",
              "value": "api-testmode"
            }
          ],
          "headersSize": 776,
          "httpVersion": "HTTP/1.1",
          "redirectURL": "",
          "status": 200,
          "statusText": "OK"
        },
        "startedDateTime": "2023-07-11T08:54:23.407Z",
        "time": 899,
        "timings": {
          "blocked": -1,
          "connect": -1,
          "dns": -1,
          "receive": 0,
          "send": 0,
          "ssl": -1,
          "wait": 899
        }
      }
    ],
    "pages": [],
    "version": "1.2"
  }
}
